# Lab 3-28-22

## Concat and merge a DataFrame

In [1]:
import pandas as pd
import numpy as np

In [12]:
#Function to generate a synthetic dataframe
def make_df(cols, ind):
    dd = {} #Empty dictionary to store everything
    for c in cols:
        dlis =[] #Empty list to store values
        for i in ind:         
            val = str(c)+str(i) #creates each value
            dlis.append(val)
#            print(c, i, val) #printout flag to check
            dd[c]=dlis #fills out the column
#    print('this is dd: ', dd)
#    print('this is ind: ', ind)
    return pd.DataFrame(dd, ind) #converts dict and return

In [13]:
# Calling the function to create a DataFrame
make_df('XYZ', range(4))

    X   Y   Z
0  X0  Y0  Z0
1  X1  Y1  Z1
2  X2  Y2  Z2
3  X3  Y3  Z3

In [ ]:
"""Simplification of make_df function in a single line
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)
"""

# Pandas Concat

In [14]:
#Ex. 1: Pandas Concatenation

#concatenate two dataframes with same columns
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

print("df1 = \n", df1); print("df2 = \n", df2); 
print("df1 concatenated with df2 = \n", pd.concat([df1, df2]))

df1 =
     A   B
1  A1  B1
2  A2  B2
df2 =
     A   B
3  A3  B3
4  A4  B4
df1 concatenated with df2 =
     A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [16]:
#concatenate two dataframes with same columns
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print("df3 = \n", df3); print("df4 = \n", df4); 
print("df3 concatenated with df4 = \n", pd.concat([df3, df4], axis=1))

df3 =
     A   B
0  A0  B0
1  A1  B1
df4 =
     C   D
0  C0  D0
1  C1  D1
df3 concatenated with df4 =
     A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [17]:
#Ex. 2
#Concatenating dataframes with only a few columns in common
#two options: Inner Join and Outer join (default)

df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print("df5 = \n",df5); print("df6 = \n",df6); 
print("df5 concatenated with df6 = \n", pd.concat([df5, df6]))

df5 =
     A   B   C
1  A1  B1  C1
2  A2  B2  C2
df6 =
     B   C   D
3  B3  C3  D3
4  B4  C4  D4
df5 concatenated with df6 =
      A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [18]:
#inner join - only columns in common will survive the concatenation
print("df5 = \n",df5); print("df6 = \n",df6); 
print("df5 concatenated with df6 = \n", pd.concat([df5, df6], join='inner'))

df5 =
     A   B   C
1  A1  B1  C1
2  A2  B2  C2
df6 =
     B   C   D
3  B3  C3  D3
4  B4  C4  D4
df5 concatenated with df6 =
     B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

# Pandas Merge

In [19]:
#Ex. 3
#one-to-one join
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print("df1 = \n", df1); print("df2 = \n", df2)

df3 = pd.merge(df1, df2)
print("df1 merged with df2 = \n",df3)

df1 =
   employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
df2 =
   employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
df1 merged with df2 =
   employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [20]:
#Many-to-one join
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print("df3 = \n", df3); print("df4 = \n", df4)
print("df3 merged with df4 = \n", pd.merge(df3, df4))

df3 =
   employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
df4 =
          group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
df3 merged with df4 =
   employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [21]:
#Many-to-many join
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
print("df1 = \n", df1); print("df5 = \n", df5); 
print("df1 merged with df5 = \n",pd.merge(df1, df5))

df1 =
   employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
df5 =
          group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
df1 merged with df5 =
   employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [22]:
#Ex. 4
#Use of the on keyword
print("df1 = \n", df1); print("df2 = \n", df2); 
print("Merge on Employee\n", pd.merge(df1, df2, on='employee'))

df1 =
   employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
df2 =
   employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
Merge on Employee
   employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [23]:
#Left_on and right_on keywords
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print("df1 = \n", df1); print("df3 = \n", df3);
print("Merge with left_on right_on\n", pd.merge(df1, df3, left_on="employee", right_on="name"))

df1 =
   employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
df3 =
    name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
Merge with left_on right_on
   employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [24]:
print("Merge with left_on right_on and dropping dup column\n")
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

Merge with left_on right_on and dropping dup column

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [2]:
#Ex.5
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                    columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

print("df6 = \n", df6); print("df7 = \n", df7); 
print("Merge of df6 with df7\n", pd.merge(df6, df7))

#inner join
print("Merge of df6 with df7 with inner join\n", pd.merge(df6, df7, how='inner'))

#outer join
print("Merge of df6 with df7 with outer join\n", pd.merge(df6, df7, how='outer'))

#left join
print("Merge of df6 with df7 with left join\n", pd.merge(df6, df7, how='left'))

df6 =
     name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
df7 =
      name drink
0    Mary  wine
1  Joseph  beer
Merge of df6 with df7
    name   food drink
0  Mary  bread  wine
Merge of df6 with df7 with inner join
    name   food drink
0  Mary  bread  wine
Merge of df6 with df7 with outer join
      name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer
Merge of df6 with df7 with left join
     name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [3]:
print("Merge of df6 with df7 with right join\n", pd.merge(df6, df7, how='right'))

Merge of df6 with df7 with right join
      name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer